tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling1D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

\rm -rf 0
cp -r 0.org 0

runApplication blockMesh
runApplication $application

if ! isTest $@
then
    foamDictionary system/controlDict -entry endTime -set 5
    foamDictionary 2/T.liquid -entry boundaryField.wall2.q -set 'uniform 500000'
    foamDictionary 2/T.liquid -entry boundaryField.wall1.q -set 'uniform 500000'
    runApplication -a $application
fi

#------------------------------------------------------------------------------
